<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type" ></meta>
    <title>Documentation humaine de l&apos;XSLT TEF2pivot</title></head><body>
<h1>Documentation humaine de l&apos;XSLT TEF2pivot</h1>
<h2>La recommandation TEF</h2>
<p><a href="https://www.theses.fr/schemas/tef/recommandation/index.html" target="_blank" rel="noopener">https://www.theses.fr/schemas/tef/recommandation/index.html</a></p>
<p><em>&quot;La recommandation TEF (Th&egrave;ses Electroniques Fran&ccedil;aises) d&eacute;finit un jeu de m&eacute;tadonn&eacute;es pour les th&egrave;ses &eacute;lectroniques soutenues en France. Son objectif est d'organiser de mani&egrave;re coh&eacute;rente des m&eacute;tadonn&eacute;es de th&egrave;se riches et normalis&eacute;es, afin de faciliter leur &eacute;change et leur diffusion, au niveau national ou international. Ces m&eacute;tadonn&eacute;es recouvrent des m&eacute;tadonn&eacute;es descriptives (bibliographiques) et des m&eacute;tadonn&eacute;es de gestion (administration, droits, conservation).</em></p>
<p><em>Cette recommandation propose &agrave; la fois une mod&eacute;lisation de ces m&eacute;tadonn&eacute;es et un format XML. Ce format est un format d'&eacute;change et un outil de validation. Il consiste en un sch&eacute;ma XML qui permet de sp&eacute;cifier la structure et le contenu d'une notice TEF, auquel s'ajoutent des r&egrave;gles de validation Schematron qui expriment avec pr&eacute;cision les contraintes propres &agrave; TEF, qui elles-m&ecirc;mes refl&egrave;tent les textes r&eacute;glementaires nationaux qui organisent le circuit des th&egrave;ses &eacute;lectroniques. Ce format XML s'appuie sur le sch&eacute;ma METS qui permet d'articuler les diff&eacute;rents types de m&eacute;tadonn&eacute;es.</em></p>
<p><em>En s'appuyant sur METS et Schematron, TEF n'est pas tant un nouveau format qu'une structure modulaire et souple qui pourra s'adapter aux &eacute;volutions du cadre r&eacute;glementaire ou &agrave; un contexte d'utilisation particulier. &ldquo;</em></p>
<h2>Gen&egrave;se de l&rsquo;XSL&nbsp;</h2>
<p>Cet XSL est le premier &agrave; avoir &eacute;t&eacute; &eacute;crit. Il a permis de d&eacute;velopper les m&eacute;canismes qui sous tendent le format pivot ainsi qu&rsquo;une partie du son vocabulaire. Cependant le pivot s&rsquo;est &ldquo;affin&eacute;&rdquo; lorsqu&rsquo;on s&rsquo;est confront&eacute; aux autres sources sans que l&rsquo;on revienne sur cette &ldquo;premi&egrave;re mouture&rdquo; d'o&ugrave; la pr&eacute;sence de quelques sp&eacute;cificit&eacute;s propre &agrave; ce format : non prise en compte de l&rsquo;entit&eacute; Item, traitement partiel de l&rsquo;indexation Rameau.</p>
<h2>Adaptations du mod&egrave;le TEF au tronc OEMI</h2>
<p style="text-align: justify;">Les donn&eacute;es sont, contrairement aux autres sources, compl&egrave;tement LRMis&eacute;es : chaque fichier contient tout un ensemble OEMI : une oeuvre, une ou deux expressions au maximum (pour le TEF issu de STAR), appel&eacute;es dans ce contexte &ldquo;version compl&egrave;te&rdquo; / &ldquo;version incompl&egrave;te&rdquo;, et une ou plusieurs manifestations (ou &ldquo;&eacute;ditions&rdquo;, en fonction des formats : ici seules les manifestations &eacute;lectroniques sont signal&eacute;es. Et des fichiers correspondant aux items.</p>
<p style="text-align: justify;">Toutefois les items n&rsquo;ont pas &eacute;t&eacute; convertis en format pivot.</p>
<p style="text-align: justify;">Toutes les entit&eacute;s ont un sous-type &ldquo;Th&egrave;se&rdquo;.</p>
<p style="text-align: justify;"><em>Structure FRBR de TEF</em></p>
<p style="text-align: justify;"><em><img src="images/TEF2.png" alt="Structure FRBR de TEF" /></em></p>
<p style="text-align: justify;">Le nommage des entit&eacute;s a &eacute;t&eacute; construit sur le NNT (identifiant national de th&egrave;se), qui est propre &agrave; chaque oeuvre, et donc peut &ecirc;tre d&eacute;clin&eacute; facilement pour toutes les entit&eacute;s OEMI.</p>
<h4 style="text-align: justify;">Expressions</h4>
<p style="text-align: justify;">Appel&eacute;es &ldquo;versions&rdquo; dans TEF, elles s&rsquo;appuient sur la notion de th&egrave;se &ldquo;compl&egrave;te&rdquo; ou &ldquo;incompl&egrave;te&rdquo;. On peut avoir ou non le d&eacute;tail des diff&eacute;rences, qui peuvent &ecirc;tre pr&eacute;cis&eacute;es en notes.</p>
<p style="text-align: justify;"><img src="images/TEF2.png" alt="Versions compl&egrave;te / incompl&egrave;te" /></p>
<p style="text-align: justify;">Les expressions de th&egrave;ses ont un sous type &ldquo;Version compl&egrave;te&rdquo; ou &ldquo;Version incompl&egrave;te&rdquo;. La &ldquo;version incompl&egrave;te&rdquo; peut porter une information sur son &ldquo;incompl&eacute;tude&rdquo; dans la propri&eacute;t&eacute; &ldquo;RESSOURCE_MANQUANTE&rdquo;.</p>
<p><img src="images/TEF4.png" alt="Expression manquante" /></p>
<h2 style="text-align: justify;">Contributions</h2>
<p style="text-align: justify;">Toutes les contributions sont des liens vers des identifiants idRef, et toutes au niveau de l'&oelig;uvre. En revanche, un m&ecirc;me contributeur peut appara&icirc;tre avec plusieurs r&ocirc;les (exemple : le directeur de th&egrave;se est souvent &eacute;galement membre du jury. Dans ce cas, on a une contribution par r&ocirc;le.&nbsp;</p>
<h2 style="text-align: justify;">Indexation</h2>
<p style="text-align: justify;">L&rsquo;indexation sujet est pr&eacute;sente sous forme de mots-cl&eacute;s et d&rsquo;indexation Rameau. On n&rsquo;a conserv&eacute; ici que les points d&rsquo;acc&egrave;s (&ldquo;t&ecirc;tes de vedettes&rdquo;), et non les subdivisions. Les points d&rsquo;acc&egrave;s Rameau sont convertis en relations &ldquo;A_POUR_SUJET&rdquo;, tandis que les mots cl&eacute;s sont traduits en propri&eacute;t&eacute; &ldquo;KEYWORD&rdquo;.</p>
<h2 style="text-align: justify;">Droits</h2>
<p>Les droits sont une notion cl&eacute; dans TEF. Ils peuvent &ecirc;tre associ&eacute;s &agrave; l'&oelig;uvre, mais aussi &agrave; l&rsquo;expression. Toutefois, on a laiss&eacute; de c&ocirc;t&eacute; cet aspect, qui n&rsquo;&eacute;tait pas ou peu pr&eacute;sent dans les autres sources.</p>
<p style="text-align: justify;"><em>Propri&eacute;t&eacute;s attach&eacute;es &agrave; chaque niveau FRBR de TEF</em></p>
<p style="text-align: justify;"><em><img src="images/TEF3.png" alt="Propri&eacute;t&eacute;s attach&eacute;es &agrave; chaque niveau FRBR de TEF" /></em></p></body></html>
